In [95]:
import pandas as pd
import numpy as np

In [45]:
students = pd.DataFrame({"001": {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92}, "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},
 "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": 89},
 "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},
 "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},
 "006": {"姓名": "小周", "考试1": 81, "考试2": 89, "考试3": 92}}).T
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

In [46]:
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

In [61]:
students[["考试2","姓名"]]

    考试2  姓名
001  95  小陈
002  92  小李
003  81  小王
004  89  小张
005  91  小赵
006  89  小周

In [63]:
average=students["考试2"].mean()
average

89.5

In [73]:
average3 = students.loc[:,"考试1":"考试3"].mean(axis=1)
average3

001    90.666667
002    92.333333
003    85.333333
004    87.666667
005    92.666667
006    87.333333
dtype: object

In [74]:
name = students["姓名"]
name

001    小陈
002    小李
003    小王
004    小张
005    小赵
006    小周
Name: 姓名, dtype: object

In [80]:
students_average=pd.DataFrame({"姓名":name,"平均分":average3})
students_average

     姓名        平均分
001  小陈  90.666667
002  小李  92.333333
003  小王  85.333333
004  小张  87.666667
005  小赵  92.666667
006  小周  87.333333

In [83]:
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

In [85]:
df_sorted = students.sort_values(by="考试1")
print(df_sorted)

     姓名 考试1 考试2 考试3
004  小张  79  89  95
006  小周  81  89  92
001  小陈  85  95  92
003  小王  86  81  89
002  小李  91  92  94
005  小赵  96  91  91

In [86]:
students["考试1"]

001    85
002    91
003    86
004    79
005    96
006    81
Name: 考试1, dtype: object

In [90]:
students.loc[:,"考试1":"考试3"]

    考试1 考试2 考试3
001  85  95  92
002  91  92  94
003  86  81  89
004  79  89  95
005  96  91  91
006  81  89  92

In [102]:
np.sort(students["考试1"])

array([79, 81, 85, 86, 91, 96], dtype=object)

In [118]:
students.loc[:,"考试1":"考试3"].apply(lambda x:np.sort(x))

    考试1 考试2 考试3
001  79  81  89
002  81  89  91
003  85  89  92
004  86  91  92
005  91  92  94
006  96  95  95

In [119]:
students.loc[:,"考试1":"考试3"].apply(lambda x:np.sort(x)[-2])

考试1    91
考试2    92
考试3    94
dtype: int64

In [124]:
def get_grade(score):
    if score>=95:
        return "A"
    elif score>=85:
        return "B+"
    elif score>=80:
        return "B-"
    elif score>=75:
        return "C+"
    else:
        return "C"

In [126]:
students.loc["考试1":"考试3"]

Empty DataFrame
Columns: [姓名, 考试1, 考试2, 考试3]
Index: []

In [127]:
students.loc[:,"考试1":"考试3"]

    考试1 考试2 考试3
001  85  95  92
002  91  92  94
003  86  81  89
004  79  89  95
005  96  91  91
006  81  89  92

In [135]:
students.loc[:,"考试1":"考试3"].map(get_grade)

    考试1 考试2 考试3
001  B+   A  B+
002  B+  B+  B+
003  B+  B-  B+
004  C+  B+   A
005   A  B+  B+
006  B-  B+  B+

In [139]:
students.describe()

        姓名  考试1  考试2  考试3
count    6    6    6    6
unique   6    6    5    5
top     小陈   85   89   92
freq     1    1    2    2

In [140]:
students.loc[:,"考试1":"考试3"].describe()

        考试1  考试2  考试3
count     6    6    6
unique    6    5    5
top      85   89   92
freq      1    2    2

In [141]:
students["考试1"]

001    85
002    91
003    86
004    79
005    96
006    81
Name: 考试1, dtype: object

In [146]:
students["考试1"].astype('int')

001    85
002    91
003    86
004    79
005    96
006    81
Name: 考试1, dtype: int64

In [149]:
students["考试2"].astype('int')
students["考试3"].astype('int')

001    92
002    94
003    89
004    95
005    91
006    92
Name: 考试3, dtype: int64

In [155]:
students["考试1"] = students["考试1"].astype('int')
students["考试2"] = students["考试2"].astype('int')
students["考试3"] = students["考试3"].astype('int')
students

     姓名  考试1  考试2  考试3
001  小陈   85   95   92
002  小李   91   92   94
003  小王   86   81   89
004  小张   79   89   95
005  小赵   96   91   91
006  小周   81   89   92

In [156]:
students.describe()

             考试1        考试2        考试3
count   6.000000   6.000000   6.000000
mean   86.333333  89.500000  92.166667
std     6.314006   4.722288   2.136976
min    79.000000  81.000000  89.000000
25%    82.000000  89.000000  91.250000
50%    85.500000  90.000000  92.000000
75%    89.750000  91.750000  93.500000
max    96.000000  95.000000  95.000000